# Data Visualization with Modern Data Science

> Getting Started with SQL

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com)

In [1]:
%LOAD sqlite3 db=data/covid19.db timeout=2 shared_cache=true

## What is SQL

## The definition

SQL(pronounced ess-que-ell or sequel) is a language specifically designed with **relational databases**. SQL enables people to create databases, add new data to them, maintain the data in them, and retrieve selected parts of the data via **database management system**. Developed in the 1970s at IBM, SQL has grown and advanced over the years to become the industry standard.

## Subcategories of SQL

- DQL, short for **Data Query Language**.
- DML, short for **Data Manipulation Language**.
- DDL, short for **Data Definition Language**.
- DCL, short for **Data Control Language**.
- TCL, short for **Transaction Control Language**.

## Subcategories of SQL(Cont'd)

- DQL: statements begin with `SELECT`.
- DML: statements begin with `INSERT`, `UPDATE`, `DELETE`...etc.
- DDL: statements begin with `CREATE`, `DROP`, `ALTER`...etc.
- DCL: statements begin with `GRANT`, `REVOKE`...etc.
- TCL: statements begin with `COMMIT`, `ROLLBACK`...etc.

## What will be covered in this course

- DQL.
- A bit of DML.
- A bit of DDL.
- ~~DCL.~~
- A little bit of TCL.

## Why SQL

- SQL gives us improved programmatic control over the structure of data, leading to efficiency, speed, and accuracy.
- SQL is also an excellent adjunct to programming languages used in the data sciences, such as R and Python.
- For people with no background in programming languages, SQL often serves as an easy-to-understand introduction into concepts related to data structures and programming logic.

## What is a relational database

> A relational database is a digital database based on the relational model of data.

Source: <https://en.wikipedia.org/wiki/Relational_database>

## What is a database

> A database is like a collection of data items (comic books, product orders and player profile).If we define the term more strictly, a database is a **self-describing** collection of **integrated records**. A record is a representation of some physical or conceptual object.

Source: <https://www.amazon.com/SQL-Dummies-Computer-Tech/dp/1119527074>

## Characteristics of a database

- Integrated records: the observations in a database is accompanied by attributes.
- Self-describing: a database contains metadata.

## What does integrated records mean

In [2]:
SELECT * 
  FROM daily_report
 LIMIT 5;

+--------------+---------------------+-----------+--------+
| Combined_Key | Last_Update         | Confirmed | Deaths |
+--------------+---------------------+-----------+--------+
| Afghanistan  | 2022-03-01 04:21:09 | 173659    | 7598   |
+--------------+---------------------+-----------+--------+
| Albania      | 2022-03-01 04:21:09 | 271563    | 3469   |
+--------------+---------------------+-----------+--------+
| Algeria      | 2022-03-01 04:21:09 | 264936    | 6835   |
+--------------+---------------------+-----------+--------+
| Andorra      | 2022-03-01 04:21:09 | 37999     | 151    |
+--------------+---------------------+-----------+--------+
| Angola       | 2022-03-01 04:21:09 | 98741     | 1900   |
+--------------+---------------------+-----------+--------+
5 rows in set (0.00 sec)

## What does self-describing mean

> Metadata is "data that provides information about other data". In other words, it is "data about data".

Source: <https://en.wikipedia.org/wiki/Metadata>

## Seriously, what the f*** is metadata?

![](https://media.giphy.com/media/xT0xeif517lOYwnH2g/giphy.gif)

Source: <https://media.giphy.com/media/xT0xeif517lOYwnH2g/giphy.gif>

## Metadata of `covid19`

In [3]:
SELECT name
  FROM sqlite_schema
 WHERE name NOT LIKE 'sqlite_%';

+--------------+
| name         |
+--------------+
| lookup_table |
+--------------+
| daily_report |
+--------------+
| time_series  |
+--------------+
3 rows in set (0.00 sec)

## Metadata of `covid19.daily_report`

In [4]:
SELECT * 
  FROM PRAGMA_TABLE_INFO('daily_report');

+-----+--------------+---------+---------+------------+----+
| cid | name         | type    | notnull | dflt_value | pk |
+-----+--------------+---------+---------+------------+----+
| 0   | Combined_Key | TEXT    | 0       | NULL       | 1  |
+-----+--------------+---------+---------+------------+----+
| 1   | Last_Update  | TEXT    | 0       | NULL       | 0  |
+-----+--------------+---------+---------+------------+----+
| 2   | Confirmed    | INTEGER | 0       | NULL       | 0  |
+-----+--------------+---------+---------+------------+----+
| 3   | Deaths       | INTEGER | 0       | NULL       | 0  |
+-----+--------------+---------+---------+------------+----+
4 rows in set (0.00 sec)

## Metadata of `covid19.lookup_table`

In [5]:
SELECT * 
  FROM PRAGMA_TABLE_INFO('lookup_table');

+-----+----------------+---------+---------+------------+----+
| cid | name           | type    | notnull | dflt_value | pk |
+-----+----------------+---------+---------+------------+----+
| 0   | UID            | INTEGER | 0       | NULL       | 1  |
+-----+----------------+---------+---------+------------+----+
| 1   | Combined_Key   | TEXT    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 2   | iso2           | TEXT    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 3   | iso3           | TEXT    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 4   | Country_Region | TEXT    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 5   | Province_State | TEXT    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 6   | Admin2         | TEXT    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 7   | Lat            | REAL    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 8   | Long_          | REAL    | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 9   | Population     | INTEGER | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
10 rows in set (0.00 sec)

## Metadata of `covid19.time_series`

In [6]:
SELECT * 
  FROM PRAGMA_TABLE_INFO('time_series');

+-----+----------------+---------+---------+------------+----+
| cid | name           | type    | notnull | dflt_value | pk |
+-----+----------------+---------+---------+------------+----+
| 0   | Date           | TEXT    | 0       | NULL       | 1  |
+-----+----------------+---------+---------+------------+----+
| 1   | Country_Region | TEXT    | 0       | NULL       | 2  |
+-----+----------------+---------+---------+------------+----+
| 2   | Confirmed      | INTEGER | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 3   | Deaths         | INTEGER | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 4   | Daily_Cases    | INTEGER | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
| 5   | Daily_Deaths   | INTEGER | 0       | NULL       | 0  |
+-----+----------------+---------+---------+------------+----+
6 rows in set (0.00 sec)

## What is a database management system

> The database management system (DBMS) is the software that interacts with end users, applications, and the database itself to capture and analyze the data.

Source: <https://en.wikipedia.org/wiki/Database>

## What is a database management system, the less technical version

A database management system (DBMS) bridges the application program(could be a web application, programming environment, or just a client interface) and the database.

## There are a lot of relational database management systems

- SQL Server by Microsoft.
- MySQL by Oracle.
- DB2 by IBM.
- PostgreSQL.
- **SQLite**.
- ...etc.

## What is SQLite

> SQLite is a relational database management system (RDBMS). In contrast to many other database management systems, SQLite is not a clientâ€“server database engine. Rather, it is embedded into the end program.

Source: <https://en.wikipedia.org/wiki/SQLite>

## Why SQLite

- It is open-sourced.
- It is self-contained.
- It is light and portable.
- I PERSONALLY think it is the best way for newbies to learn SQL on local machine.

## Getting SQLiteStudio

## What is SQLiteStudio

> SQLiteStudio is desktop application for browsing and editing SQLite database files. It is aimed for people, who know what SQLite is, or what relational databases are in general.

Source: <https://sqlitestudio.pl/about>

## Download and install SQLiteStudio

- Windows: [SQLiteStudio-3.2.1.exe](https://drive.google.com/file/d/1bK0_JskM_8r2biRnClfrrvHwjr2kqn4S/view?usp=sharing)
- MacOS: [SQLiteStudio-3.2.1.dmg](https://drive.google.com/file/d/1EVZJucCRK49d4L7c8F9-fUAUsTYvRNpN/view?usp=sharing)

## Downloading an established database `covid19.db` from [course repository](https://mybinder.org/v2/gh/datainpoint/classroom-data-visualization-with-modern-data-science-2022/HEAD?urlpath=tree/data)

## Now we have a SQLite database client that is able to connect to an established database in our own local machine

- Database > Add a database.
- Browse for existing database on local computer > OK.
- Database > Connect to the database.

## A few "Hello, World!" like SQL statements

In [7]:
SELECT *
  FROM daily_report
 LIMIT 5;

+--------------+---------------------+-----------+--------+
| Combined_Key | Last_Update         | Confirmed | Deaths |
+--------------+---------------------+-----------+--------+
| Afghanistan  | 2022-03-01 04:21:09 | 173659    | 7598   |
+--------------+---------------------+-----------+--------+
| Albania      | 2022-03-01 04:21:09 | 271563    | 3469   |
+--------------+---------------------+-----------+--------+
| Algeria      | 2022-03-01 04:21:09 | 264936    | 6835   |
+--------------+---------------------+-----------+--------+
| Andorra      | 2022-03-01 04:21:09 | 37999     | 151    |
+--------------+---------------------+-----------+--------+
| Angola       | 2022-03-01 04:21:09 | 98741     | 1900   |
+--------------+---------------------+-----------+--------+
5 rows in set (0.00 sec)

In [8]:
SELECT *
  FROM lookup_table
 LIMIT 5;

+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| UID | Combined_Key       | iso2 | iso3 | Country_Region | Province_State | Admin2 | Lat      | Long_     | Population |
+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 4   | Afghanistan        | AF   | AFG  | Afghanistan    | NULL           | NULL   | 33.93911 | 67.709953 | 38928341   |
+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 8   | Albania            | AL   | ALB  | Albania        | NULL           | NULL   | 41.1533  | 20.1683   | 2877800    |
+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 10  | Antarctica         | AQ   | ATA  | Antarctica     | NULL           | NULL   | -71.9499 | 23.347    | NULL       |
+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 12  | Algeria            | DZ   | DZA  | Algeria        | NULL           | NULL   | 28.0339  | 1.6596    | 43851043   |
+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 16  | American Samoa, US | AS   | ASM  | US             | American Samoa | NULL   | -14.271  | -170.132  | 55641      |
+-----+--------------------+------+------+----------------+----------------+--------+----------+-----------+------------+
5 rows in set (0.00 sec)

In [9]:
SELECT *
  FROM time_series
 LIMIT 5;

+------------+----------------+-----------+--------+-------------+--------------+
| Date       | Country_Region | Confirmed | Deaths | Daily_Cases | Daily_Deaths |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Afghanistan    | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Albania        | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Algeria        | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Andorra        | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Angola         | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
5 rows in set (0.00 sec)

## What is a SQL statement

- A SQL statement is a combination of keywords, object names(e.g. databases/tables/columns/functions), constants, and operators.
- SQL keywords are NOT case sensitive.
- Semicolon `;` is the standard way to separate each SQL statement in database systems that allow more than one SQL statement to be executed in the same call.
- Indentations or new lines are OPTIONAL in SQL statements.

## SQL keywords are NOT case sensitive

In [10]:
select *
  from daily_report
 limit 5;

+--------------+---------------------+-----------+--------+
| Combined_Key | Last_Update         | Confirmed | Deaths |
+--------------+---------------------+-----------+--------+
| Afghanistan  | 2022-03-01 04:21:09 | 173659    | 7598   |
+--------------+---------------------+-----------+--------+
| Albania      | 2022-03-01 04:21:09 | 271563    | 3469   |
+--------------+---------------------+-----------+--------+
| Algeria      | 2022-03-01 04:21:09 | 264936    | 6835   |
+--------------+---------------------+-----------+--------+
| Andorra      | 2022-03-01 04:21:09 | 37999     | 151    |
+--------------+---------------------+-----------+--------+
| Angola       | 2022-03-01 04:21:09 | 98741     | 1900   |
+--------------+---------------------+-----------+--------+
5 rows in set (0.00 sec)

## Indentations or new lines are OPTIONAL in SQL statements

In [11]:
SELECT *
FROM lookup_table
LIMIT 3;

+-----+--------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| UID | Combined_Key | iso2 | iso3 | Country_Region | Province_State | Admin2 | Lat      | Long_     | Population |
+-----+--------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 4   | Afghanistan  | AF   | AFG  | Afghanistan    | NULL           | NULL   | 33.93911 | 67.709953 | 38928341   |
+-----+--------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 8   | Albania      | AL   | ALB  | Albania        | NULL           | NULL   | 41.1533  | 20.1683   | 2877800    |
+-----+--------------+------+------+----------------+----------------+--------+----------+-----------+------------+
| 10  | Antarctica   | AQ   | ATA  | Antarctica     | NULL           | NULL   | -71.9499 | 23.347    | NULL       |
+-----+--------------+------+------+----------------+----------------+--------+----------+-----------+------------+
3 rows in set (0.00 sec)

In [12]:
SELECT * FROM time_series LIMIT 3;

+------------+----------------+-----------+--------+-------------+--------------+
| Date       | Country_Region | Confirmed | Deaths | Daily_Cases | Daily_Deaths |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Afghanistan    | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Albania        | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
| 2020-01-22 | Algeria        | 0         | 0      | 0           | 0            |
+------------+----------------+-----------+--------+-------------+--------------+
3 rows in set (0.00 sec)

## Adopt a style guide before writing your own SQL statements

- **[SQL style guide by Simon Holywell](https://www.sqlstyle.guide/)**
- [SQL Style Guide | GitLab](https://about.gitlab.com/handbook/business-technology/data-team/platform/sql-style-guide/)
- [SQL Style Guide - Mozilla Data Documentation](https://docs.telemetry.mozilla.org/concepts/sql_style.html)
- ...etc.

## Format SQL in SQLiteStudio

- Write down your SQL statements.
- Highlight statements and right click for drop-down list -> Format SQL.

## Beginning with `SELECT` and `FROM`

## Basic `SELECT` syntax

A SELECT statement that fetches every row and column in a table.

```sql
SELECT *
  FROM table_name;
```

## Selecting a subset of rows and columns

It is more practical to limit the rows and columns the query retrieves, especially with large tables.

```sql
SELECT column_names
  FROM table_name
 LIMIT n;
```

In [13]:
SELECT Combined_Key,
       Confirmed
  FROM daily_report
 LIMIT 5;

+--------------+-----------+
| Combined_Key | Confirmed |
+--------------+-----------+
| Afghanistan  | 173659    |
+--------------+-----------+
| Albania      | 271563    |
+--------------+-----------+
| Algeria      | 264936    |
+--------------+-----------+
| Andorra      | 37999     |
+--------------+-----------+
| Angola       | 98741     |
+--------------+-----------+
5 rows in set (0.00 sec)

## Using `DISTINCT` to find unique values

- It is common for a column to contain rows with duplicates.
- To understand the range of values in a column, we can use the `DISTINCT` keyword.

```sql
SELECT DISTINCT column_name
  FROM table_name;
```

In [14]:
SELECT DISTINCT Country_Region
  FROM lookup_table
 LIMIT 5;

+----------------+
| Country_Region |
+----------------+
| Afghanistan    |
+----------------+
| Albania        |
+----------------+
| Antarctica     |
+----------------+
| Algeria        |
+----------------+
| US             |
+----------------+
5 rows in set (0.00 sec)

## Sorting data with `ORDER BY`

We order the results of a query using the keywords `ORDER BY` followed by the name of the column(s) to sort.

```sql
SELECT column_names
  FROM table_name
 ORDER BY column_names;
```

In [15]:
SELECT Combined_Key,
       Confirmed
  FROM daily_report
 ORDER BY Confirmed
 LIMIT 5;

+--------------------------+-----------+
| Combined_Key             | Confirmed |
+--------------------------+-----------+
| Diamond Princess, Canada | 0         |
+--------------------------+-----------+
| Unknown, China           | 0         |
+--------------------------+-----------+
| Unknown, Colombia        | 0         |
+--------------------------+-----------+
| Unknown, India           | 0         |
+--------------------------+-----------+
| Unknown, Malaysia        | 0         |
+--------------------------+-----------+
5 rows in set (0.00 sec)

## By default, `ORDER BY` sorts values in ascending order

If we want to sort in descending order, add the `DESC` keyword.

```sql
SELECT column_names
  FROM table_name
 ORDER BY column_names DESC;
```

In [16]:
SELECT Combined_Key,
       Confirmed
  FROM daily_report
 ORDER BY Confirmed DESC
 LIMIT 5;

+-------------------------+-----------+
| Combined_Key            | Confirmed |
+-------------------------+-----------+
| France                  | 22098808  |
+-------------------------+-----------+
| England, United Kingdom | 16059214  |
+-------------------------+-----------+
| Turkey                  | 14089456  |
+-------------------------+-----------+
| Argentina               | 8900656   |
+-------------------------+-----------+
| Maharashtra, India      | 7865705   |
+-------------------------+-----------+
5 rows in set (0.00 sec)

## We are not limited to sorting on just one column

In [17]:
SELECT Date,
       Country_Region,
       Daily_Cases
  FROM time_series
 ORDER BY Date DESC,
          Daily_Cases DESC
 LIMIT 5;

+------------+----------------+-------------+
| Date       | Country_Region | Daily_Cases |
+------------+----------------+-------------+
| 2022-02-28 | Korea, South   | 138993      |
+------------+----------------+-------------+
| 2022-02-28 | Germany        | 132801      |
+------------+----------------+-------------+
| 2022-02-28 | Vietnam        | 122480      |
+------------+----------------+-------------+
| 2022-02-28 | Russia         | 105745      |
+------------+----------------+-------------+
| 2022-02-28 | US             | 96464       |
+------------+----------------+-------------+
5 rows in set (0.00 sec)

## Filtering rows with `WHERE`

The `WHERE` keyword allows us to find rows that match a specific value, a range of values, or multiple values.

```sql
SELECT column_names
  FROM table_name
 WHERE condition;
```

In [18]:
SELECT *
  FROM daily_report
 WHERE Combined_Key = 'Taiwan';

+--------------+---------------------+-----------+--------+
| Combined_Key | Last_Update         | Confirmed | Deaths |
+--------------+---------------------+-----------+--------+
| Taiwan       | 2022-03-01 04:21:09 | 20489     | 853    |
+--------------+---------------------+-----------+--------+
1 row in set (0.00 sec)

## The above query uses equals `=` to find rows that exactly match, but we can use other operators

## Relational and logical operators

- `=`: Equal to.
- `!=`: Not equal to.
- `>`, `>=`: Greater than; Greater than or equal to.
- `<`, `<=`: Less than; Less than or equal to.
- `BETWEEN`: Within a range.
- `IN`: Match one of a set of values.
- `LIKE`: Match a pattern.
- `NOT`: Negates a condition.
- `AND`: Intersects conditions.
- `OR`: Union conditions.

## Using the `BETWEEN` operator

In [19]:
SELECT Country_Region,
       Province_State,
       Population
  FROM lookup_table
 WHERE Population BETWEEN 20000000 AND 30000000;

+----------------+----------------+------------+
| Country_Region | Province_State | Population |
+----------------+----------------+------------+
| Australia      | NULL           | 25459700   |
+----------------+----------------+------------+
| Cameroon       | NULL           | 26545864   |
+----------------+----------------+------------+
| Sri Lanka      | NULL           | 21413250   |
+----------------+----------------+------------+
| Taiwan         | NULL           | 23816775   |
+----------------+----------------+------------+
| Cote d'Ivoire  | NULL           | 26378275   |
+----------------+----------------+------------+
| Madagascar     | NULL           | 27691019   |
+----------------+----------------+------------+
| Mali           | NULL           | 20250834   |
+----------------+----------------+------------+
| Nepal          | NULL           | 29136808   |
+----------------+----------------+------------+
| Niger          | NULL           | 24206636   |
+----------------+----------------+------------+
| Burkina Faso   | NULL           | 20903278   |
+----------------+----------------+------------+
| Venezuela      | NULL           | 28435943   |
+----------------+----------------+------------+
| Yemen          | NULL           | 29825968   |
+----------------+----------------+------------+
| Brazil         | Minas Gerais   | 21168791   |
+----------------+----------------+------------+
| China          | Beijing        | 21893095   |
+----------------+----------------+------------+
| China          | Gansu          | 25019831   |
+----------------+----------------+------------+
| China          | Inner Mongolia | 24049155   |
+----------------+----------------+------------+
| China          | Jilin          | 24073453   |
+----------------+----------------+------------+
| China          | Shanghai       | 24870895   |
+----------------+----------------+------------+
| China          | Xinjiang       | 25852345   |
+----------------+----------------+------------+
| India          | Chhattisgarh   | 29436231   |
+----------------+----------------+------------+
| India          | Haryana        | 28204692   |
+----------------+----------------+------------+
| US             | Florida        | 21477737   |
+----------------+----------------+------------+
| US             | Texas          | 28995881   |
+----------------+----------------+------------+
23 rows in set (0.00 sec)

## Using the `IN` operator

In [20]:
SELECT Country_Region,
       Province_State,
       Population
  FROM lookup_table
 WHERE Country_Region IN ('Taiwan', 'Japan', 'Korea, South');

+----------------+-----------------+------------+
| Country_Region | Province_State  | Population |
+----------------+-----------------+------------+
| Taiwan         | NULL            | 23816775   |
+----------------+-----------------+------------+
| Japan          | NULL            | 126476458  |
+----------------+-----------------+------------+
| Korea, South   | Korea           | 51269183   |
+----------------+-----------------+------------+
| Japan          | Aichi           | 7552239    |
+----------------+-----------------+------------+
| Japan          | Akita           | 966490     |
+----------------+-----------------+------------+
| Japan          | Aomori          | 1246371    |
+----------------+-----------------+------------+
| Japan          | Chiba           | 6259382    |
+----------------+-----------------+------------+
| Japan          | Ehime           | 1339215    |
+----------------+-----------------+------------+
| Japan          | Fukui           | 767937     |
+----------------+-----------------+------------+
| Japan          | Fukuoka         | 5103679    |
+----------------+-----------------+------------+
| Japan          | Fukushima       | 1845519    |
+----------------+-----------------+------------+
| Japan          | Gifu            | 1986587    |
+----------------+-----------------+------------+
| Japan          | Gunma           | 1942456    |
+----------------+-----------------+------------+
| Japan          | Hiroshima       | 2804177    |
+----------------+-----------------+------------+
| Japan          | Hokkaido        | 5250049    |
+----------------+-----------------+------------+
| Japan          | Hyogo           | 5466190    |
+----------------+-----------------+------------+
| Japan          | Ibaraki         | 2860307    |
+----------------+-----------------+------------+
| Japan          | Ishikawa        | 1137649    |
+----------------+-----------------+------------+
| Japan          | Iwate           | 1226816    |
+----------------+-----------------+------------+
| Japan          | Kagawa          | 956347     |
+----------------+-----------------+------------+
| Japan          | Kagoshima       | 1602273    |
+----------------+-----------------+------------+
| Japan          | Kanagawa        | 9198268    |
+----------------+-----------------+------------+
| Japan          | Kochi           | 698029     |
+----------------+-----------------+------------+
| Japan          | Kumamoto        | 1747567    |
+----------------+-----------------+------------+
| Japan          | Kyoto           | 2582957    |
+----------------+-----------------+------------+
| Japan          | Mie             | 1780882    |
+----------------+-----------------+------------+
| Japan          | Miyagi          | 2306365    |
+----------------+-----------------+------------+
| Japan          | Miyazaki        | 1073301    |
+----------------+-----------------+------------+
| Japan          | Nagano          | 2048790    |
+----------------+-----------------+------------+
| Japan          | Nagasaki        | 1326524    |
+----------------+-----------------+------------+
| Japan          | Nara            | 1330123    |
+----------------+-----------------+------------+
| Japan          | Niigata         | 2223106    |
+----------------+-----------------+------------+
| Japan          | Oita            | 1135434    |
+----------------+-----------------+------------+
| Japan          | Okayama         | 1889586    |
+----------------+-----------------+------------+
| Japan          | Okinawa         | 1453168    |
+----------------+-----------------+------------+
| Japan          | Osaka           | 8809363    |
+----------------+-----------------+------------+
| Japan          | Saga            | 814711     |
+----------------+-----------------+------------+
| Japan          | Saitama         | 7349693    |
+----------------+-----------------+------------+
| Japan          | Shiga           | 1413943    |
+----------------+-----------------+------------+
| Japan          | Shimane         | 674346     |
+----------------+-----------------+------------+
| Japan          | Shizuoka        | 3643528    |
+----------------+-----------------+------------+
| Japan          | Tochigi         | 1933990    |
+----------------+-----------------+------------+
| Japan          | Tokushima       | 727977     |
+----------------+-----------------+------------+
| Japan          | Tokyo           | 13920663   |
+----------------+-----------------+------------+
| Japan          | Tottori         | 555558     |
+----------------+-----------------+------------+
| Japan          | Toyama          | 1043502    |
+----------------+-----------------+------------+
| Japan          | Wakayama        | 924933     |
+----------------+-----------------+------------+
| Japan          | Yamagata        | 1077666    |
+----------------+-----------------+------------+
| Japan          | Yamaguchi       | 1358336    |
+----------------+-----------------+------------+
| Japan          | Yamanashi       | 810956     |
+----------------+-----------------+------------+
| Japan          | Port Quarantine | NULL       |
+----------------+-----------------+------------+
| Japan          | Unknown         | NULL       |
+----------------+-----------------+------------+
52 rows in set (0.00 sec)

## Using `LIKE` with `WHERE`

Relational operators are fairly straightforward, but `LIKE` deserves additional explanations.

## `LIKE` lets us search for patterns in strings by using two wildcard characters

- Percent sign `%`: A wildcard matching one or more characters.
- Underscore `_`: A wildcard matching just one character.

## Using `LIKE` with `WHERE` and `%`

In [21]:
SELECT DISTINCT Country_Region
  FROM lookup_table
 WHERE Country_Region LIKE '%land';

+----------------+
| Country_Region |
+----------------+
| New Zealand    |
+----------------+
| Finland        |
+----------------+
| Iceland        |
+----------------+
| Ireland        |
+----------------+
| Poland         |
+----------------+
| Switzerland    |
+----------------+
| Thailand       |
+----------------+
7 rows in set (0.00 sec)

## Using `LIKE` with `WHERE` and `_`

In [22]:
SELECT DISTINCT Country_Region
  FROM lookup_table
 WHERE Country_Region LIKE 'T_____';

+----------------+
| Country_Region |
+----------------+
| Taiwan         |
+----------------+
| Turkey         |
+----------------+
2 rows in set (0.00 sec)

## Combining conditions with `AND` and `OR`

We can combine conditions using `AND` and `OR`.

## Combining conditions with `AND`

In [23]:
SELECT DISTINCT Country_Region
  FROM lookup_table
 WHERE Country_Region LIKE '%land' AND
       Population > 30000000;

+----------------+
| Country_Region |
+----------------+
| Poland         |
+----------------+
| Thailand       |
+----------------+
2 rows in set (0.00 sec)

## Combining conditions with `OR`

In [24]:
SELECT DISTINCT Country_Region
  FROM lookup_table
 WHERE Country_Region LIKE '%land' OR
       Country_Region LIKE 'T_____';

+----------------+
| Country_Region |
+----------------+
| Taiwan         |
+----------------+
| New Zealand    |
+----------------+
| Finland        |
+----------------+
| Iceland        |
+----------------+
| Ireland        |
+----------------+
| Poland         |
+----------------+
| Switzerland    |
+----------------+
| Thailand       |
+----------------+
| Turkey         |
+----------------+
9 rows in set (0.00 sec)

## Putting what we have so far all together

SQL is about the order of keywords, so follow this convention:

```sql
SELECT column_names
  FROM table_name
 WHERE conditions
 ORDER BY column_names
 LIMIT n;
```